@extends('layouts.auth')
@section('title', 'ایجاد حساب ')
@section('content')
    <div class="authentication-wrapper authentication-basic container-p-y">
        <div class="authentication-inner py-4">
            <!-- Register Card -->
            <div class="card p-2">
                <div class="app-brand justify-content-center mt-5">
                    <a href="{{ url('/') }}" class="app-brand-link gap-2">
                       <span class="app-brand-logo demo">
                          <img src="{{ asset('assets/img/darklogodadvarzan.png') }}" alt="موسسه حقوقی دادورزان امین" width="40">
                        </span>
                        <span class="text-white fw-bold">موسسه حقوقی دادورزان امین</span>
                    </a>
                </div>

                <div class="card-body mt-2">
                    <h4 class="text-white mb-2 fw-semibold">ایجاد حساب</h4>
                    <p class="text-white mb-4">لطفاً اطلاعات زیر را با دقت وارد کنید</p>


                    @include('partials.alerts')


                    @if ($errors->any())
                        <div class="alert alert-danger alert-dismissible fade show" role="alert">
                            <strong>خطا در ارسال فرم:</strong>
                            <ul class="mb-0 mt-2 pe-3">
                                @foreach ($errors->all() as $error)
                                    <li>{{ $error }}</li>
                                @endforeach
                            </ul>
                            <button type="button" class="btn-close" data-bs-dismiss="alert" aria-label="Close"></button>
                        </div>
                    @endif

                    <form id="formAuthentication" class="mb-3" method="POST" action="{{ route('fullregister') }}" novalidate>
                        @csrf

                        <div class="form-floating form-floating-outline mb-3">
                            <input type="text" class="form-control @error('phone') is-invalid @enderror" id="phone" name="phone" placeholder="شماره موبایل" value="{{ old('phone') }}" autocomplete="off" required>
{{--                            <label for="phone">شماره موبایل</label>--}}
                            @error('phone')
                            <div class="invalid-feedback d-block">{{ $message }}</div>
                            @enderror
                        </div>

                        <div class="form-floating form-floating-outline mb-3">
                            <input type="text" class="form-control @error('national_id') is-invalid @enderror" id="national_id" name="national_id" placeholder=" کد ملی" value="{{ old('national_id') }}" autocomplete="off" required>
{{--                            <label for="national_id">کد ملی</label>--}}
                            @error('national_id')
                            <div class="invalid-feedback d-block">{{ $message }}</div>
                            @enderror
                        </div>

                        <div class="form-floating form-floating-outline mb-3">
                            <input type="text" data-jdp class="form-control @error('birthday') is-invalid @enderror" id="birthday" name="birthday" placeholder="تاریخ تولد" value="{{ old('birthday') }}" autocomplete="off" required>
{{--                            <label for="birthday">تاریخ تولد</label>--}}
                            @error('birthday')
                            <div class="invalid-feedback d-block">{{ $message }}</div>
                            @enderror
                        </div>

                        <div class="form-floating form-floating-outline mb-3">
                            <select name="role_id" class="form-control" required>
                                <option value="">انتخاب کنید</option>
                                @foreach(\App\Models\Role::select('id' , 'title_fa')->whereIn('id' , [5,6,7])->get() as $type)
                                    <option class="text-black" value="{{$type->id}}" {{ old('role_id') == $type->id ? 'selected' : '' }}>{{$type->title_fa}}</option>
                                @endforeach
                            </select>
                        </div>

                        <div class="mb-3">
                            <div class="form-password-toggle">
                                <div class="input-group input-group-merge">
                                    <div class="form-floating form-floating-outline">
                                        <input type="password" class="form-control @error('password') is-invalid @enderror" id="password" name="password" placeholder="رمز عبور" required>
{{--                                        <label for="password">رمز عبور</label>--}}
                                        @error('password')
                                        <div class="invalid-feedback d-block">{{ $message }}</div>
                                        @enderror
                                    </div>
                                    <span class="input-group-text cursor-pointer"><i class="mdi mdi-eye-off-outline"></i></span>
                                </div>
                            </div>
                        </div>

                        <div class="mb-3">
                            <div class="form-password-toggle">
                                <div class="input-group input-group-merge">
                                    <div class="form-floating form-floating-outline">
                                        <input type="password" class="form-control @error('password_confirmation') is-invalid @enderror" id="password_confirmation" name="password_confirmation" placeholder="تأیید رمز عبور" required>
{{--                                        <label for="password_confirmation">تکرار رمز عبور</label>--}}
                                        @error('password_confirmation')
                                        <div class="invalid-feedback d-block">{{ $message }}</div>
                                        @enderror
                                    </div>
                                    <span class="input-group-text cursor-pointer"><i class="mdi mdi-eye-off-outline"></i></span>
                                </div>
                            </div>
                        </div>

                        <div class="mb-3 d-flex justify-content-between">
                            <div class="form-check">
                                <input class="form-check-input @error('terms_accepted') is-invalid @enderror" type="checkbox" id="terms-accepted" name="terms_accepted" {{ old('terms_accepted') ? 'checked' : '' }} required>
                                <label class="form-check-label text-white" for="terms-accepted">
                                    <a href="#" data-bs-toggle="modal" data-bs-target="#termsModal">شرایط و قوانین</a> را با دقت مطالعه نموده‌ام.
                                </label>
                                @error('terms_accepted')
                                <div class="invalid-feedback d-block">{{ $message }}</div>
                                @enderror
                            </div>
                        </div>

                        <div class="mb-3">
                            <button class="btn btn-primary d-grid w-100" type="submit">{{ __('ثبت اطلاعات') }}</button>
                        </div>
                    </form>

                    <p class="text-center">
                        <span class="text-white">حساب کاربری دارید؟</span>
                        <a href="{{ route('login') }}">
                            <span>ورود به حساب</span>
                        </a>
                    </p>
                </div>
            </div>
        </div>
    </div>


    <div class="modal fade" id="termsModal" tabindex="-1" aria-labelledby="termsModalLabel" aria-hidden="true">
        <div class="modal-dialog modal-lg modal-dialog-scrollable">
            <div class="modal-content">
                <div class="modal-header">
                    <h5 class="modal-title" id="termsModalLabel">شرایط و قوانین</h5>
                    <button type="button" class="btn-close" data-bs-dismiss="modal" aria-label="بستن"></button>
                </div>
                <div class="modal-body">
                    <div class="terms-and-conditions p-3" dir="rtl" lang="fa" style="text-align: justify">
                        <p>این سند، یک قرارداد لازمالاجرا فی مابین موسسه حقوقی دادورزان امین (سهامی خاص) به شماره ثبت 41727 با علامت تجاری دادورزان امین و کاربر است که کلیه حقوق و تعهدات کاربر و دادورزان امین در قبال یکدیگر را تعیین میکند. ایجاد حساب کاربری در دادورزان امین، به این معنی است که کاربران از کلیه حقوق و تعهدات مندرج در این سند آگاهی کامل دارند و با آن موافقت نموده اند؛ لذا ضروری است پیش از ایجاد حساب کاربری، این شرایط و ضوابط را بهدقت مطالعه فرمایند.</p>

                        <p>ماده ۱) مقدمه</p>

                        <p>موسسه حقوقی دادورزان امین ارائه دهنده خدمات حقوقی به کسبوکارهای کوچک، متوسط و بزرگ ایرانی است.</p>

                        <p>تیم دادورزان امین با توجه به تجربه و شناختی که از اکوسیستم کارآفرینی ، صنایع و تجارت ایران دارد و با استفاده از فناوریهای به روز و فرایندهای آنلاین و سریع؛ خدمات حقوقی منحصر به فرد، مقرون به صرفه و کاربردیای را به کارآفرینان و مدیران کسبوکارهای ایرانی ارائه میدهد. دادورزان امین برای ارائه خدمات حقوقی به دریافت کنندگان خدمات، دارای تیمی جوان، خلاق و پرانرژی از وکلا و حقوقدانان کاربلد در حوزه ها و زمینه های مختلف حقوقی کسب و کارهاست. اعضای این تیم، دانش آموخته برگزیده ترین مراکز آموزشی و دانشگاههای کشور بوده و ضمن کسب دانش و اخذ گواهینامه های مربوط به مهارت های علمی، از تجربه چندین ساله انباشته در ارائه خدمات حقوقی مختلف پیش گفته به شرکت ها و کسب و کارها برخوردارند. بدیهی است انعقاد قرارداد با دادورزان امین و نیز بهره برداری از خدمات آن به منزله پذیرش این توافقنامه است و امکان طرح هرگونه ادعای مخالف با آن در آینده را از شما سلب و ساقط می کند.</p>

                        <p>ماده ۲) تعاریف</p>

                        <p>تعاریف برخی از اصطلاحات به کار برده شده در این قرارداد از این قرار است:</p>


                        <p>محتوا:کلیه مطالب اعم از تصویری، نوشتاری و صوتی موجود در وبسایت میباشد که شامل و نه محدود به اطلاعات، دادهها، گرافیک، نرمافزار، آیکون دکمه، علائم تجاری، سرویسهای الکترونیکی، تصاویر، فایلهای صوتی و تصویری میباشد. در صورتی که محتوا توسط دادورزان امین بارگذاری شود، محتوای دادورزان امین و اگر توسط کاربر بارگذاری شود، محتوای کاربران نامیده میشود.</p>
                        <p>محتوای حقوقی:شامل کلیه اسناد حقوقی، قراردادهای موجود در وبسایت و صورتجلسات میباشد، مالکیت محتوای حقوقی متعلق به دادورزان امین است و در قبال دریافت محتوای حقوقی و پرداخت هزینهی آن توسط کاربران، صرفاً مجوز استفاده از محتوای حقوقی داده میشود نه مالکیت محتوای حقوقی.</p>
                        <p>حساب کاربری:حساب کاربری شما، پنل شخصی شما است که از طریق یک نام کاربری (ایمیل/شماره تماس) و رمز عبور به آن دسترسی پیدا میکنید و از طریق آن به خدمات حقوقی و ابزارهای آنلاین مورد درخواست خود دسترسی خواهید داشت.</p>
                        <p>عامل پرداخت:موسسه مالی، بانک یا درگاه پرداختی که از آن برای پرداخت بهای ارائه خدمات درخواست شده استفاده میکنید.</p>
                        <p>استفاده شخصی:خودآموزی و مقاصد شخصی به جز هرگونه دسترسی گروهی.</p>
                        <p>دارایی فکری:داراییهای فکری مانند متون، محتوای حقوقی، طرحهای گرافیکی، عکس، علائم تجاری، لوگو، کدهای نرمافزار، اطلاعات کاربران، محتوای دادورزان امین، ساختار و نحوه بیان و تنظیم مطالب است که متعلق به شرکت میباشد.</p>
                        <p>موسسه /ما:منظور موسسه حقوقی دادورزان امین به شماره ثبت 41727 است.</p>
                        <p>فورس ماژور:منظور از فورس ماژور، وقوع هرگونه حادثه خارجی، غیر قابل دفع و غیر قابل پیشبینی است که مستند به فعل یا ترک فعل هیچیک از طرفین (ما و شما) نباشد. از جمله مصادیق آن میتوان به سیل، زلزله، آتشسوزی، جنگ، اعتصاب، بیماریهای واگیردار، قطعی سراسری اینترنت، بروز اختلالات در شبکههای بالادست و زیرساختی از جمله شرکتهای خدماتدهنده سرور، اینترنت ایران و یا اینترنت جهانی، قطع سراسری برق و یا دیگر حوادث این چنینی اشاره نمود.</p>
                        <p>اشتراک حقوقی:بسته خدمات حقوقی دادورزان امین است که کاربر اشتراکی با انعقاد قرارداد اختصاصی با دادورزان امین و پرداخت مبلغ معین در بازههای زمانی معین از آن بهرهمند میشود.</p>
                        <p>کاربر اشتراکی:شخصی است که جهت مدیریت و پیشبرد امور حقوقی کسب و کار خود، با انعقاد قرارداد اختصاصی با ما، از اشتراک حقوقی ما استفاده می کند.</p>
                        <p>خدمات:خدمات دادورزان امین به صورت برخط (آنلاین) ارائه شده و شامل بانک اسناد حقوقی و قراردادها، مشاوره حقوقی تخصصی به شکل تلفنی، آنلاین و حضوری، امکان درخواست تنظیم و بررسی قراردادهای حقوقی و اسناد حقوقی، تنظیم اوراق قضایی و پشتیبانی از آنان، درخواست ثبت اموال فکری، حفاظت از دارایی فکری، تاسیس شرکت و ثبت صورتجلسات تغییرات شرکتها و درخواست استفاده از خدمات وکیل برای دعاوی تخصصی حقوقی و کیفری کسب و کارها است. این پلتفرم شامل کلیه محتوا و خدمات ارائه شده توسط دادورزان امین میباشد. جزییات برخی از خدمات به شرح ذیل است:
                        <ul>
                            <p>تنظیم قراردادها و اسناد حقوقی:شامل و نه محدود به قراردادهای سرمایه گذاری، قراردادهای پیمانکاری، قراردادی حوزه منابع انسانی، قراردادهای مشارکت، آیین نامه های داخلی مثل آیین نامه معاملات به زبان های فارسی، انگلیسی و عربی مورد نیاز کسب و کار.</p>
                            <p>امور ثبتی شرکت ها و مؤسسات و حاکمیت شرکتی:شامل خدمات تاسیس شرکت ها و تنظیم صورتجلسات تغییرات، دریافت پلمپ دفاتر، انحلال و تصفیه شرکت.</p>
                            <p>خدمات مالکیت فکری:شامل ارسال اظهارنامه های ثبت علامت تجاری (برند)، طرح صنعتی، اختراع و اخذ گواهینامه های نهایی مالکیت آن ها به نام خدمات گیرنده و نیز تغییرات آن ها شامل اضافه نمودن طبقات و نقل و انتقال (تغییر مالکیت) آن هاست.</p>
                            <p>خدمات حفاظت از دارایی فکری:شامل انجام کلیه فرآیندهای لازم در راستای برخورد و مسدودسازی ناقضان علامت کسب و کار در فضای مجازی شامل اینستاگرام، تلگرام، یوتیوب، اپارات، گوگل پلی، کافه بازار و امثالهم.</p>
                            <p>اوراق قضایی:شامل تدوین اظهارنامه، دادخواست، شکوائیه و لایحه دفاعیه مربوط به کسب و کار.</p>
                            <p>اخذ مجوزها:شامل و محدود به اخذ اینماد، ساماندهی وزارت ارشاد، اتحادیه کشوری کسب و کار مجازی، نظام صنفی یارانه ای، دانش بنیان.</p>
                            <p>مشاوره حقوقی تخصصی:شامل ارائه راهنمایی حقوقی حسب مورد و بر اساس قرارداد منعقده میان طرفین به صورت های مختلف حضوری، تلفنی و آنلاین می باشد.</p>
                        </ul>
                        </p>
                        <p>دادورزان امین:دادورزان امین پلتفرم آنلاین ارائه خدمات حقوقی به آدرس dadvarzanamin.ir است که موسسه از طریق آن به ارائه خدمات می پردازد.</p>
                        <p>کاربر/شما:شخصی حقیقی یا حقوقی هستید که با انتخاب گزینه ورود یا ثبت نام وارد دادورزان امین می شوید و ممکن است از خدمات رایگان یا غیر رایگان ما استفاده کنید.</p>
                        <p>کارشناس حقوقی اختصاصی:کارشناسی در تیم حقوقی دادورزان امین است که پیشبرد درخواست شما به طور اختصاصی به او ارجاع شده است. کارشناس حقوقی اختصاصی مختص کاربران اشتراکی است.</p>
                        <p>تعهد به وسیله (فعل):بر اساس آن تعهد فرد صرفاً به انجام کار خواسته شده است و چنانچه شخص متعهد تمام تلاش خود را برای انجام دقیق و صحیح کار مورد نظر را انجام دهد اما به هر دلیلی نتیجه مورد نظر طرف مقابل از آن حاصل نشود مسئولیتی ندارد همچون تعهد وکیل، پزشك، سردفتر و امین.</p>
                        <p>تعهد به نتیجه:در آن تعهد فرد نه تنها به انجام کار خواسته شده که حصول نتیجه مورد نظر طرف مقابل نیز هست و در صورت عدم حصول نتیجه، شخص متعهد مسئولیت خواهد داشت همچون تعهدات پیمانکاران ساختمانی.</p>


                        <p>ماده ۳) شرایط استفاده</p>


                        <p>شما برای ثبت نام و ایجاد حساب کاربری در دادورزان امین باید حداقل ۱۸ سال تمام شمسی داشته باشید. شما مجاز نیستید که نام کاربری و رمز ورود حساب خود را در اختیار شخص دیگری قرار بدهید و یا به کسی اجازه بدهید به حساب شما و خدمات ارائه شده دسترسی پیدا کند. شما مسئول تمام استفاده ای هستید که از وبسایت و خدمات ارائه شده در ارتباط با حساب شما و نام کاربری و رمز ورود شما انجام میگیرد.</p>
                        <p>مسئولیت صحت اطلاعاتی که در حساب خود وارد میکنید، تماماً با خود شما است. شما مسئول هستید که نام کاربری و رمز ورود خود را محرمانه نگه دارید و برای این کار تلاش لازم و معقول را انجام دهید. هر زمان که از استفاده غیرمجاز از نام کاربری، رمز، حساب، یا خدمات ارائه شده به شما مطلع گشتید، باید در سریع ترین زمان ممکن به پشتیبانی دادورزان امین اطلاع دهید.</p>
                        <p>شما مسئول حساب کاربری خود و هر اتفاقی هستید که که در زمان ورود شما به حساب کاربری یا استفاده شما از حساب کاربری رخ می دهد. ما مسئول هیچ گونه ضرر و خسارت ناشی از استفاده غیرمجاز از کامپیوتر، تلفن همراه یا سایر وسایل هوشمند شما نیستیم.</p>
                        <p>ما میتوانیم به دلایل قانونی یا کاری و اداری محتوای ارائه شده و هرگونه خدمات ارائه شده را حذف کنیم. چنانچه قصد داشتیم محتوای ارائه شده و یا خدمات ارائه شده را حذف کنیم، تلاش معقولی خواهیم کرد تا به شما از طریق ایمیل و یا پیامک اطلاع بدهیم، اما این کار بسته به دلیل یا ضرورتِ حذف، همیشه ممکن نخواهد بود.</p>
                        <p>اگر در دسترسی به حساب یا هر بخشی از محتوای دریافت شده و در دریافت ارائه خدمات به مشکلی برخوردید، لطفاً با ما تماس بگیرید.</p>
                        <p>کاربر اشتراکی ملزم به رعایت کلیه مفاد این سند خواهد بود مگر اینکه خلاف آن صریحا در قرارداد اختصاصی او با ما پیشبینی شده باشد.</p>
                        <p>فعالسازی خدمات مورد تقاضای کاربر منوط به پرداخت هزینههای اعلام شده در قالب صورتحساب است و ما بدون پرداخت این هزینهها هیچ گونه تعهدی در خصوص ارائه خدمات به مشتری نداریم. مدت زمان لازم برای صدور صورتحساب پس از دریافت درخواست مکتوب مشتری (فرم سفارش، ایمیل، پیام الکترونیکی، خرید آنلاین و حداکثر ۲۴ ساعت بوده و مهلت پرداخت صورتحساب ۱۰ روزکاری است. در صورت عدم پرداخت صورتحساب در مهلت مقرر ما میتوانیم نسبت به تمدید صورتحساب صادر شده و یا صدور صورتحساب جدید اقدام نموده و در صورت نیاز بنا بر صلاحدید خود از ارائه خدمات به مشتری صرف نظر نماییم.</p>
                        <p>شما با افتتاح حساب در دادورزان امین می پذیرید که دادورزان امین برای اطلاع رسانی های خود از ایمیل، پیامک و یا اعلان در حساب کاربری شما به عنوان راه ارتباطی استفاده کند. شما می توانید درخواست کنید که ارسال پیامک و یا ایمیل به شما قطع شود مشروط بر آنکه بپذیرید با انصراف از دریافت این پیام ها ممکن است در استفاده از خدمات با مشکل مواجه شوید و یا اطلاعات مورد نیاز به موقع به شما نرسد.</p>
                        <p>با ایجاد حساب کاربری شما قادر خواهید بود تا در سایت دادورزان امین در قسمت درج نظرات و در قسمت پرسش و پاسخ، داده هایی را در قالب کلمات وارد نمایید.</p>
                        <p>در ارتباط با دارایی های اشخاص ثالث شما اقرار و تایید می کنید که تمامی مراحل اجازه ی استفاده از اموال فکری و مطالب سایر اشخاص را طی کرده اید وبنابراین مجوز استفاده از آن ها را دارا هستید.</p>
                        <p>به جز محتوایی که توسط کارمندان، مشاوران و سایر عوامل دادورزان امین تهیه می شود، دادورزان امین هیچ گونه ادعای مالکیتی بر اطلاعاتی که در حسابتان درج، ذخیره یا پردازش می کنید، نخواهد داشت و شما مالکیت و کنترل و علاوه بر آن مسئولیت این اطلاعات را برعهده خواهید داشت.</p>
                        <p>اگر به نمایندگی از یک شخص اعم از حقیقی یا حقوقی از این سایت استفاده می نمایید، اقرار می کنید که نماینده قانونی شخص مذکور هستید و اختیار ملزم کردن اصیل را نسبت به این شرایط و قوانین در اختیار دارید.</p>
                        <p>با توجه به این قرارداد میان ما و شما، دادورزان امین اجازه استفاده غیر انحصاری و غیر قابل انتقال از پلتفرم دادورزان امین را به کاربر اعطاء میکند. کلیه حقوق، منافع، محتوا ( محتوای حقوقی و غیرحقوقی) و خدمات پلتفرم دادورزان امین به استثنای محتوای کاربر، در مالکیت انحصاری دادورزان امین و اشخاصی است که دادورزان امین به آنها مجوز بهرهبرداری از پلتفرم را اعطاء کرده است.</p>
                        <p>شما هر وقت که بخواهید میتوانید اطلاعات خود را در پنل کاربری ویرایش کنید. برای حذف اکانت نیز میتوانید برای ما ایمیل ارسال کنید.</p>
                        <p>ما سعی میکنیم که شما دسترسی شبانه روزی در تمامی ۷ روز هفته داشته باشید، و سعی میکنیم هرگونه زمان از کارافتادگی را به حداقل برسانیم. ممکن است به دلیل تعمیر و نگهداری وبسایت، یا دلایل و مشکلات فنی دیگر لازم باشد دسترسی شما به وبسایت یا ارائه خدمات و محتوای وبسایت را موقتاً متوقف یا معلق کنیم، ولی سعی میکنیم زمانش را بسیار کوتاه کنیم.</p>
                        <p>مسئولیت پرداخت تمامی هزینهها و مالیات مرتبط به استفادهتان از وبسایت در هر جایی که مالیاتی بر آن تعیین شده باشد (از جمله مالیات بر ارزش افزوده، اگر نافذ و دارای موضوعیت باشد)، با شما است.</p>


                        <p>ماده ۴) محتوای حقوقی دریافت شده</p>

                        <p>محتوای حقوقی دریافت شده شامل مواردی مثل قراردادها، اوراق قضایی و سایر اسناد حقوقی است که به طور جداگانه با پرداخت هزینه دریافت شده است. اولین باری که محتوایی را دریافت می کنید، لازم است در سایت ثبت نام کرده و یک حساب کاربری باز کنید. پرداخت برای محتوای قابل دریافت غیر رایگان از طریق صفحه اختصاصی هر محتوا انجام میگیرد. تمام قیمتهای وبسایت ما به تومان است. محتوای حقوقی دریافت شده توسط شما همیشه در حساب کاربری شما میباشد، شما میتوانید با ورود به حساب کاربری خود به این محتوای حقوقی دسترسی داشته باشید.</p>

                        <p>ماده ۵) سلب مسئولیت</p>


                        <p>کلیه اطلاعات حقوقی که در بخش مجله حقوقی (وبلاگ) دادورزان امین و همچنین کلیه اطلاعات حقوقی در بخش پرسش و پاسخ دادورزان امین، نبایستی مبنایی برای تصمیمات شخصی، قانونی و مالی قرار گیرد؛ شما بایستی جهت دریافت مشاوره تخصصی از کارشناسان مربوطه، درخواست مشاوره خود را در دادورزان امین ثبت کرده و مشاوره متناسب با اوضاع و احوال موضوع، سوال، مشکل و پرونده ی خود دریافت نمایید. هرگونه مسئولیت استفاده از محتوای مجله حقوقی و اطلاعات حقوقی پرسش و پاسخ ها بر عهده شما خواهد بود.</p>
                        <p>ممکن است در سایت دادورزان امین به ضرورت لینک منابع و سایت های آنلاین دیگر قرار گیرد. این لینک ها برای سهولت دسترسی شما به آن منابع و سایت ها است . سایت دادورزان امین حامی و یا به هیچ صورتی مرتبط با منابع و سایت های قرار گرفته شده در لینک نمی باشد. دادورزان امین اجازه ی استفاده از نام تجاری، علامت تجاری ثبت شده، لوگو، مهر رسمی یا حقوق مالکیت فکری منتشر در سایت های مذکور را ندارد و مسلم است که اختیار واگذاری حق استفاده از آن ها را به شما نیز نخواهد داشت. اگر شما از منابع و سایت های لینک مندرج در سایت دادورزان امین استفاده کردید، دادورزان امین مسئول هیچ گونه فعل یا ترک فعل شخص ثالث از جمله دسترسی یا استفاده از اطلاعات کاربران خود نخواهد بود. همچنین دادورزان امین هیچ گونه خدماتی را که توسط آن سایت ارائه می شود، تضمین یا حمایت نمی کند.</p>
                        <p>ما تنها متعهد به وعدههای صریح و آشکاری هستیم که در این توافقنامه دادهایم. در قبال برداشتهای ضمنی از توافقنامه هیچ تعهد و مسئولیتی نداریم؛ ما تلاش معقولی میکنیم که محتوا یا دسترسی شما به وبسایت بدون وقفه و مشکل باشد و باقی بماند و اینکه ایرادها رفع شوند و محتوای وبسایت عاری از ویروس و دیگر اجزاء مخرب باشد، ولی هیچکدام از این موارد را نمیتوانیم تضمین کنیم و تضمینی نمیدهیم؛ ما تلاش معقولی میکنیم که دسترسی شما به وبسایت برقرار باشد، و وبسایت یا محتوای آن از نظر صحت، دقت، به هنگام بودن، کامل بودن، قابل اعتماد بودن، و موارد مشابه برای شما قابل تکیه و قابل اعتماد باشد، ولی هیچکدام از این موارد را نمیتوانیم تضمین کنیم و (و مسئول نیستیم) و هیچگونه تعهد و مسئولیتی در قبال انعقاد قراردادهای شما با دیگران نخواهیم داشت. تا آنجایی که قانون اجازه میدهد، مسئولیت ما در قبال هر نوع تخطی از ضمانت یا شرایط که قابل استثناء و رد نباشد، به انتخاب خودمان، محدود به جایگزینی و یا پرداخت هزینه جایگزینی خواهد بود.</p>
                        <p>وکلا و کارشناسان حقوقی دادورزان امین واجد قدرت و اختیارات فرا قانونی نمیباشند و در حدود تجربه و تخصص خویش و طرق قانونی اقدام مینمایند و هیچ وکیل اختیار تعهد و تضمین نتیجه را ندارد و اقدام وکیل در راستای تعهد به عمل میباشد، چرا که تصمیم نهایی توسط قضات، محاکم و دستگاه قضا صادر میگردد و وکلا فقط در راستای احقاق حقوق کاربران در حد توان علمی و تجربه و تخصص خود عمل مینمایند.</p>


                        <p>ماده ۶) کارهایی که در وب سایت دادورزان امین نمی توانید انجام دهید</p>


                        <p>با استفاده از این وبسایت شما موافقت میکنید که این کارها را انجام ندهید: آدرس ایمیل غیرواقعی ارائه بدهید، هویت دیگران را تقلید یا جعل کنید، یا ارتباط خود با دیگران را به شکل نادرستی نشان بدهید؛ سعی کنید از طریق دادورزان امین به سیستمهای کامپیوتری یا مطالبی دسترسی غیرمجاز پیدا کنید، یا مهندسی معکوس انجام دهید؛ از طریق دادورزان امین یا در وبسایت دادورزان امین دست به جمع آوری خودکار اطلاعات بزنید روشهایی مثل اسپایدرینگ (spidering)، خواندن صفحه نمایش (screen scraping)، دیتابیس اسکریپینگ (database scraping)، یا جمع آوری آدرس ایمیلها، و روشهای دیگر؛ تلاش برای ایجاد وقفه یا تغییر در عملکرد دادورزان امین به هر شکلی (مثلاً از طریق ارسال انبوه پیامهای ناخواسته یا (flooding) ایجاد بار روی سرورها، یا وارد کردن ویروس، بمب زمانی (time bomb)، اسب تروآ (Trojan horse)، کرم، کنسل بات (cancelbot) یا دیگر روشهای مخرب کامپیوتری و هک کردن؛ استفاده از دادورزان امین یا هر بخشی از محتوای آن به شکلی که نقض قوانین نافذ باشد، حقوق مالکیت معنوی یا حقوق دیگری را از ما یا دیگران نقض کند، یا اینکه فریب کارانه، وقیحانه، گستاخانه، گمراه کننده، یا توهینآمیز باشد؛ استفاده از اسکریپت برای دانلود انبوه محتوا؛ تبلیغ، برندینگ، یا محتوای پروموشن (ترویجی) در وبسایت یا محتوای آن وارد کنید؛ به غیر از مواردی که در این توافقنامه اجازه داده شده، دست به کپی، باز توزیع، انتقال، یا تغییر یا سوءاستفاده از محتوا، دادهها، یا کد وبسایت بزنید. شما موظف هستید از شماره تلفن همراه متعلق به خود استفاده کنید، در غیر اینصورت در برابر صاحب امتیاز خط تلفن همراه شخصا مسئول خواهید بود و دادورزان امین می تواند نسبت به لغو عضویت شما اقدام کند. در صورت نقض هر یک از مفاد این بند، شما متعهد به جبران کلیه خسارات وارده به ما خواهید بود. همچنین ما حق پیگیری حقوقی موضوع در مراجع ذی صلاح را خواهیم داشت.</p>
                        <p>کسب و کار ما بر پایه مالکیت فکری است، که شامل حقوق مؤلف نیز می شود. ما باید از حقوق مالکیت فکری خود دفاع کنیم، تا بتوانیم همچنان این بستر و محتواهای حقوقی را برای شما فراهم نماییم. شما با رعایت حقوق مالکیت فکری، به رشد و توسعه کسب و کارهای محتوا محور فارسی کمک میکنید. شما با استفاده از وبسایت ما، میپذیرید هیچ محتوایی را با اهداف تجاری باز توزیع نمیکنید، کپی نمیکنید، انتقال نمیدهید، واگذار نمیکنید، نمیفروشید، اجاره نمیدهید، قرض نمیدهید، اقتباس نمیکنید، و در قالب دیگری قرار نمیدهید (مگر آنکه مشخصاً در این توافقنامه اجازه داده شده باشد)، و از این محتوا برای هیچ مقصودی که ما مشخصاً بیان نکردهایم، استفاده نخواهید کرد.</p>


                        <p>ماده ۷) سطح ارائه خدمات</p>


                        <p>پشتیبانی ویژه به معنی اختصاص کارشناس حقوقی مختص به مشتریان اشتراکی است.</p>
                        <p>تعهد دادورزان امین در ارائه خدمات امور ثبتی شرکت ها و مؤسسات از نوع تعهد به نتیجه می باشد. دادورزان امین تعهد می کند که در صورت لزوم با ارسال چندین باره صورتجلسات و اظهارنامه ها نتیجه مورد نظر خدمات گیرنده محقق شود. بدیهی است با توجه به اینکه بررسی و ثبت این مدارک توسط سازمانها و نهادهای عمومی و دولتی انجام می شود دادورزان امین نمی تواند بازه زمانی دقیقی برای انجام این خدمات معین کند اما در هر صورت ملتزم می شود که خدمات موضوع این بند را حداکثر ظرف سه ماه از تاریخ تکمیل مدارک توسط دریافت کنندگان خدمات، به انجام نهایی برساند. روشن است که تحویل کار در مدت مزبور منوط به همکاری کامل طرف قرارداد در ارسال مدارک و اسناد مورد نیاز خواهد بود.</p>
                        <p>تعهد دادورزان امین در ارائه خدمات مربوط به ثبت مالکیت های فکری و برخی تغییرات آن (از جمله اضافه نمودن طبقات) از نوع تعهد به وسیله می باشد. به این معنا که دادورزان امین با جستجوی علامت تجاری و طرح صنعتی درخواستی، شانس علامت یا طرح مزبور را امکان سنجی تقریبی می کند و در صورت داشتن این امکان که البته تعیین میزان و درصد دقیق آن به دلائل مختلف (از جمله مشخص نبودن قطعی مجوزهای مورد نیاز در پاره ای موارد) غیر ممکن است، موضوع را به خدمات گیرنده جهت تصمیم گیری مقتضی (ارسال علامت یا طرح فعلی و یا جایگزینی آن با طرح یا علامتی که شانس ثبتی بالاتری دارد) اعلام می کند. تقریبی بودن این امکان سنجی به این دلیل است که به روز رسانی بانک جستجوی مرکز مالکیت معنوی سازمان ثبت اسناد و املاک کشور با کندی و باگهای فراوان (از جمله عدم بارگذاری اظهارنامه های ارسال شده و نه لزوماً ثبت شده) روبروست. همانند خدمت بند سابق تعیین زمان دقیق انجام این خدمت نیز به صورت دقیق میسر نیست اما دادورزان امین متعهد می شود در بازه زمانی شش الی هشت ماه این فرآیند (ارسال اظهارنامه تا تحویل گواهینامه ثبتی به خدمات گیرنده) را تکمیل نماید.</p>


                        <p>تبصره:پارهای تغییرات مالکیت های فکری همچون نقل و انتقال علامت تجاری یا طرح صنعتی (تغییر مالکیت) به جهت ذات و ماهیت اداری و تشریفاتی از شمول بند فوق خارج بوده و دادورزان امین حصول نتیجه در این موارد را تضمین میکند.</p>


                        <p>تعهد دادورزان امین در انجام خدمات تنظیم و بررسی قرارداد در مدت زمان اعلامی به خدمات گیرنده، تعهد به نتیجه است. اما بدیهی است که به دلیل دخالت عوامل متعدد حقوقی (از جمله اختلافات علمی و تفاوت برداشت ها) و غیر حقوقی اثر گذار بر سرنوشت یک قرارداد، دادورزان امین در هیچ زمانی نمی تواند حصول نتیجه مورد نظر خدمات گیرنده از قرارداد را برای وی تضمین کند. پس از درخواست انجام خدمات مزبور، دادورزان امین ضمن بررسی درخواست مدت زمان مورد نیاز برای انجام خدمت را به خدمات گیرنده اعلام می کند. برای تنظیم قرارداد مورد نظر ضروری است خدمات گیرنده، چک لیست دادورزان امین که شامل سؤالاتی در مورد قرارداد و جزئیات مهم آن است را تکمیل کرده و در اسرع وقت برای دادورزان امین ارسال کند. بدیهی است زمان اعلامی در تنظیم قرارداد از هنگام ارسال چک لیست مذکور محاسبه میشود.</p>
                        <p>تعهد دادورزان امین در انجام مشاوره حقوقی تخصصی به خدمات گیرنده تعهد به نتیجه بوده و ملتزم می شود در صورت درخواست مشاوره، نهایتاً ظرف مدت ۲۴ ساعت یکی از کارشناسان حقوقی آگاه به موضوع و مشکل طرح شده، از سوی دادورزان امین با شما تماس گرفته وی را به طور دقیق راهنمایی نماید. بدیهی است که ارائه مشاوره حقوقی دقیق نیازمند داشتن اطلاعات و مطالعه قبلی موضوع توسط کارشناس دادورزان امین است بنابراین ضروری است خدمات گیرنده شرح دقیق همراه با جزئیات از مشکل یا مسئله مورد نظر خود را از طریق پشتیبانی یا پنل خود در دادورزان امین ارائه دهد.</p>
                        <p>تعهد دادورزان امین در ارائه خدمت تنظیم و بررسی اوراق قضایی در مدت زمان اعلامی به شما، تعهد به نتیجه است اما بدیهی است که به دلیل دخالت عوامل متعدد حقوقی (از جمله اختلافات علمی و تفاوت برداشت ها) و غیر حقوقی اثر گذار بر سرنوشت اوراق قضایی، دادورزان امین در هیچ زمانی نمی تواند حصول نتیجه مورد نظر خدمات گیرنده از آن را برای وی تضمین کند. پس از درخواست انجام خدمات مزبور، دادورزان امین ضمن بررسی درخواست مدت زمان مورد نیاز برای انجام خدمت را به خدمات گیرنده اعلام می کند. برای تنظیم اوراق قضایی مورد نظر لازم است خدمات گیرنده، اسناد و مدارک کامل خود که برای تنظیم این اوراق ضرورت دارند را برای دادورزان امین ارسال نماید. بدیهی است زمان اعلامی در تنظیم اوراق قضایی از هنگام ارسال کامل اسناد و مدارک مزبور محاسبه می شود. کارشناس دادورزان امین برگه قضایی مورد نظر را بر اساس چک لیست ارسالی تنظیم و نسخه اولیه را برای مشتری ارسال می کند. خدمات گیرنده تا دو بار می تواند اصلاح این برگه را درخواست کند. به عبارت دیگر نسخه سوم ارسالی برای خدمات گیرنده نسخه نهایی برگه قضایی تنظیمی وی خواهد بود. همچنین در خدمت بررسی اوراق قضایی، کارشناس دادورزان امین برگه ارسالی توسط خدمات گیرنده (که لازم است به صورت فایل ورد یا پی دی اف باشد) را بررسی و تحلیل نموده، نکات، ایرادات و اصلاحات مورد نظر را از طریق کامنت بر روی فایل یادداشت گذاری می نماید. خدمات گیرنده در این مورد نیز می تواند تا دو بار سوالات و مسائل خود از کارشناس بررسی کننده را از طریق کامنت بر روی فایل مطرح کند.</p>
                        <p>تعهد دادورزان امین در ارائه تنظیم قرارداد به شما تعهد به وسیله است. ما بهترین تلاش خود را در جهت تنظیم قراردادی جامع و کامل و متناسب با نیاز و وضعیت شما انجام می دهیم و متعهد هستیم که قرارداد را ظرف پنج روز کاری از تاریخ دریافت چک لیست برای شما ارسال کنیم، اما در خصوص موارد مربوط به اجرایی شدن قرارداد مسئولیتی نخواهیم داشت.</p>
                        <p>تعهد دادورزان امین در ارائه بررسی قرارداد به شما تعهد به وسیله است. ما بهترین تلاش خود را در راستای ارزیابی و ذکر ایرادات قرارداد شما انجام می دهیم و متعهد هستیم که بررسی قرارداد را ظرف پنج روز کاری از تاریخ پرداخت برای شما ارسال کنیم اما در خصوص موارد مربوط به اجرایی شدن قرارداد مسئولیتی نخواهیم داشت. در بررسی قرارداد کارشناس مربوطه صرفاً اقدام به گذاشتن نظرات حقوقی خود در فایل می نماید و ماده ای در پیش نویس ارسالی از سوی شما تنظیم نمی گردد.</p>


                        <p>ماده ۸) عودت وجه</p>


                        <p>هدف دادورزان امین تضمین سلامت حقوقی کسبوکارهای ایرانی است و خود را متعهد به تامین کیفیت مورد نظر مشتریان، اصالت خدمات و حفظ منافع کسبوکارها میداند. ما با هدف ایجاد اطمینان حداکثری برای مشتریان خود، ضمانت کیفیت و اصالت را برای تمامی خدمات در نظر گرفتهایم. در ادامه، مصادیق این ضمانت و همچنین رویهی بازگرداندن وجه تشریح شده است. به طور کلی در دادورزان امین عودت وجه در یک بازه حداکثر سی روزه انجام میشود. این مدت از زمان تایید و احراز شرایط عودت وجه محاسبه میشود، ممکن است در شرایطی عودت وجه سریعتر انجام شود ولی حداکثر زمان سی روز است. مفاد این ماده ناظر به کاربران اشتراکی نبوده و این دسته از کاربران تابع مفاد قرارداد اختصاصی بین خودشان و ما خواهند بود.</p>
                        <p>در صورتیکه خدمات دریافتی مشتریان با اصول تعریفی در دادورزان امین مغایرت داشته باشد، تیم حقوقی دادورزان امین با جایگزینی کارشناس حقوقی سعی بر ارتقای کیفیت خدمات مشتری خواهد داشت. در نظر داشته باشید کیفیت قراردادها یک امر نسبی بوده و سعی شده با فرایندهای مختلف این کیفیت در بالاترین شرایط ممکن باشد.ما در دادورزان امین به شکل مستمر بر عملکرد اعضای تیم حقوقی خود نظارت داریم و تلاش میکنیم تا از ارائه خدمات حقوقی مغایر با قوانین و مقررات جلوگیری کنیم. در صورتی که متون اسناد حقوقی تنظیم شده توسط تیم حقوقی دادورزان امین(نمونه قرارداد، درخواست تنظیم اختصاصی قرارداد، درخواست بررسی اختصاصی قرارداد، درخواست تنظیم اختصاصی اوراق قضایی) دارای اشتباهات فاحش حقوقی و عدم مطابقت با قوانین جاری کشور حسب باشد و این امر پس از بررسی تیم دادورزان امین محرز شود، مشتری میتواند درخواست عودت وجه دهد. امکان درخواست عودت وجه فقط برای خدماتی وجود دارد که در این ماده احصا شده است.</p>
                        <p>در صورتیکه اسناد حقوقی تنظیم یا بررسی شده با توضیحات و درخواست مشتری همسو نباشد، تیم حقوقی دادورزان امین پس از بررسی درخواست مشتری و بررسی عمیق خدمات ارائه شده، تلاش میکند تا با جایگزین کارشناس حقوقی متفاوت، خدمات مطلوب مشتری را فراهم کند. درصورتیکه پس از این موضوع همچنان قرارداد یا سند حقوقی مورد نظر با درخواست و چک لیست تکمیل شده توسط مشتری تطابق نداشته باشد و این امر پس از بررسی تیم دادورزان امین محرز شود، مشتری میتواند درخواست عودت وجه دهد.</p>
                        <p>در صورت ایجاد تاخیر بیش از هفت روز کاری در ارائه خدمات از موعد تعیین شده و فورس ماژور نبودن این موضوع، شما میتواند درخواست عودت وجه دهید.</p>
                        <p>تعهد ما در دادورزان امین در خدمات ثبتی تعهد به نتیجه است. ما تمام تلاش خود را به کار میگیریم تا نتیجه مورد نظر مشتری فراهم گردد.در صورتیکه تمام مدارک مشتری کامل باشد و در موعد مقرر خود به دادورزان امین رسیده باشد و فرایند ثبتی به علت اشتباهات فاحش تیم دادورزان امین به نتیجه نرسد یا از ابتدا به دلیل اشتباه تیم فروش در اعلام شرایط کاربر(مثلا شرط داشتن مجوز برای ثبت برند)، تیم حقوقی دادورزان امین پس از بررسی درخواست مشتری و بررسی عمیق خدمات ارائه شده، تلاش میکند تا با جایگزین کارشناس حقوقی متفاوت، خدمات مطلوب مشتری را فراهم کند. درصورتیکه پس از این موضوع باز هم نتیجه مورد نظر مشتری بهدست نیاید و این امر پس از بررسی تیم دادورزان امین محرز شود، مشتری میتواند درخواست عودت وجه دهد.</p>
                        <p>مشاوره تلفنی:اگر نارضایتی مشتری از مشاوره تلفنی باشد و مصداق نارضایتی وجود داشته باشد، ۱۰۰ درصد وجه پرداختی مشتری عودت داده میشود. در صورتی که مشتری درخواست مشاوره تلفنی غیرمرتبط ثبت کرده باشد امکان عودت وجه وجود ندارد و مبلغ پرداختی مشتری به عنوان اعتبار در حساب کاربری دادورزان امین قرار میگیرد تا مشتری در آینده از سایر خدمات بهرهمند شود.</p>
                        <p>تاسیس شرکت، ثبت صورتجلسات و ثبت دارایی فکری: در صورتی که نارضایتی برای مشتری وجود داشته باشد و مصداق نارضایتی احراز شود، کل هزینه پرداختی کاربر منهای هزینههای دولتی و اداری و پست و پیک به مشتری عودت داده میشود. هنگام پشیمانی مشتری از دریافت خدمات در صورتی که مشتری تا 24 ساعت بعد از پرداخت از انجام کار پشیمان شد، ۱۰ درصد هزینه کنسلی از مبلغ پرداختی مشتری کسر شده و مابقی مبلغ به مشتری عودت داده میشود. در صورتی که مشتری پس از ۲۴ ساعت بعد از پرداخت از انجام کار پشیمان شد، ۵۰ درصد هزینه کنسلی از مبلغ پرداختی مشتری کسر شده و مابقی مبلغ به مشتری عودت داده میشود. در صورتی که فرایند تاسیس شرکت مشتری توسط دادورزان امین آغاز گردیده بود و مشتری از انجام کار پشیمان شد، ۷۰درصد هزینه کنسلی از مبلغ پرداختی مشتری کسر شده و مابقی مبلغ به مشتری عودت داده میشود. عودت وجه یک فرایند حداکثر ۳۰روز کاری از تاریخ احراز و تایید عودت وجه در دادورزان امین است.</p>
                        <p>کارت بازرگانی و سایر مجوزها: در صورتی که نارضایتی برای مشتری وجود داشته باشد و مصداق نارضایتی احراز شود، کل هزینه پرداختی کاربر منهای هزینههای دولتی و اداری و پست و پیک طی حداکثر ۳۰روز کاری به مشتری عودت داده میشود. هنگام پشیمانی مشتری از دریافت خدمات و در صورتی که مشتری تا 24 ساعت بعد از پرداخت از انجام کار پشیمان شد، 10 درصد هزینه کنسلی از مبلغ پرداختی مشتری کسر شده و مابقی مبلغ به مشتری عودت داده میشود. در صورتی که مشتری پس از 24 ساعت بعد از پرداخت از انجام کار پشیمان شد، 50 درصد هزینه کنسلی از مبلغ پرداختی مشتری کسر شده و مابقی مبلغ به مشتری عودت داده میشود.</p>


                        <p>ماده ۹) محدود کردن دسترسی</p>

                        <p>ما در هر زمانی که به نتیجه برسیم که شما از این قوانین و شرایط و یا هر قانون دارای موضوعیت، تخطی کردهاید، ممکن است دسترسی شما به حسابتان را بسته و یا به صلاحدید خودمان محدود کرده، معلق کرده، یا ملغی کنیم. البته ما در به کارگیری این اهرم و گرفتن چنین تصمیمی، معقول و منطقی برخورد خواهیم کرد. اگر تراکنش پرداخت هزینه توسط عامل پرداخت (که خارج از کنترل ما است) برگشت بخورد، یا دچار مشکلی شود، و همچنین اگر تحت شرایط ذکر شده در این توافقنامه هزینه شما عودت داده شود، ما دسترسی شما به محتوای خریداری شده و دریافت خدمات را معلق یا ملغی خواهیم کرد. اگر به هر دلیلی تراکنش مشکوک و غیرقانونی اتفاق بیفتد، تراکنشهای انجام شده لغو و باطل خواهد شد و ما دسترسی شما به محتوای خریداری شده و خدمات دریافتی را معلق یا ملغی خواهیم کرد، و همچنین این حق را برای خود محفوظ میداریم که به صلاحدید خودمان حساب شما را معلق یا مسدود کنیم.</p>

                        <p>ماده ۱۰) حریم خصوصی</p>

                        <p> جمع آوری اطلاعات و استفاده از هرگونه اطلاعات شخصی درباره شما، تحت <a href="https://dadvarzanamin.ir/%D8%AA%DB%8C%D9%85-%D9%85%D8%A7/%D8%AD%D8%B1%DB%8C%D9%85-%D8%AE%D8%B5%D9%88%D8%B5%DB%8C"> سیاست حریم خصوصی </a>ما قرار دارد. ما تنها میتوانیم اطلاعات شخصی را که در رابطه با استفادهتان از وبسایت برای ما آشکار میکنید در جهت مقاصد معینی استفاده کنیم که در سیاست حریم خصوصی ما توضیح داده شده است. پذیرش این سیاست، بخشی از توافقنامه شرایط و قوانین استفاده از وبسایت دادورزان امین میباشد. </p>

                        <p>ماده ۱۱) تغییرات سند حاضر</p>


                        <p>ما مجاز و محق هستیم که در مفاد این سند در هر زمان تغییراتی را به صورت کلی و یا جزئی اعمال نماییم. بدیهی است این تغییرات از طریق مقتضی به اطلاع کاربران خواهد رسید. در صورتی که پس از اطلاعرسانی، کاربر به استفاده خود از خدمات ما ادامه دهد، این امر به منزله پذیرش کلیه تغییرات از سوی او است.</p>
                        <p>هرگونه اخطار و اطلاعیه مربوط به دادورزان امین از جمله اطلاعیه موضوع بند 1 همین ماده، تنها به ایمیل و یا شماره تماس اعلامی کاربران هنگام ثبت نام ارسال و به آنها اطلاعرسانی خواهد شد.</p>
                        <p>در مواردی که شرایط و مقررات حاضر، صراحتاً یا ضمناً حاوی حکمی نباشد، مراتب تابع عرف رایج در این کسب و کار می باشد.</p>

                    </div>

                </div>
                <div class="modal-footer">
                    <button type="button" class="btn btn-secondary" data-bs-dismiss="modal">بستن</button>
{{--                    <button type="button" class="btn btn-primary" data-bs-dismiss="modal">قبول دارم</button>--}}
                </div>
            </div>
        </div>
    </div>

@endsection

@section('script')
    <link rel="stylesheet" href="{{'https://unpkg.com/@majidh1/jalalidatepicker/dist/jalalidatepicker.min.css'}}">
    <script type="text/javascript" src="{{'https://unpkg.com/@majidh1/jalalidatepicker/dist/jalalidatepicker.min.js'}}"></script>

    <script>
        jalaliDatepicker.startWatch();

        document.querySelector("[data-jdp-miladi-input]").addEventListener("jdp:change", function (e) {
            var miladiInput = document.getElementById(this.getAttribute("data-jdp-miladi-input"));
            if (!this.value) {
                miladiInput.value = "";
                return;
            }
            var date = this.value.split("/");
            miladiInput.value = jalali_to_gregorian(date[0], date[1], date[2]).join("/")
        });

        function jalali_to_gregorian(jy, jm, jd) {
            jy = Number(jy);
            jm = Number(jm);
            jd = Number(jd);
            var gy = (jy <= 979) ? 621 : 1600;
            jy -= (jy <= 979) ? 0 : 979;
            var days = (365 * jy) + ((parseInt(jy / 33)) * 8) + (parseInt(((jy % 33) + 3) / 4))
                + 78 + jd + ((jm < 7) ? (jm - 1) * 31 : ((jm - 7) * 30) + 186);
            gy += 400 * (parseInt(days / 146097));
            days %= 146097;
            if (days > 36524) {
                gy += 100 * (parseInt(--days / 36524));
                days %= 36524;
                if (days >= 365) days++;
            }
            gy += 4 * (parseInt((days) / 1461));
            days %= 1461;
            gy += parseInt((days - 1) / 365);
            if (days > 365) days = (days - 1) % 365;
            var gd = days + 1;
            var sal_a = [0, 31, ((gy % 4 == 0 && gy % 100 != 0) || (gy % 400 == 0)) ? 29 : 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31];
            var gm
            for (gm = 0; gm < 13; gm++) {
                var v = sal_a[gm];
                if (gd <= v) break;
                gd -= v;
            }
            return [gy, gm, gd];
        }
    </script>
    <script>
        document.addEventListener("DOMContentLoaded", function () {
            const togglePasswordElements = document.querySelectorAll('.form-password-toggle');

            togglePasswordElements.forEach(function (wrapper) {
                const toggleButton = wrapper.querySelector('.input-group-text');
                const inputField = wrapper.querySelector('input');
                const icon = toggleButton.querySelector('i');

                toggleButton.addEventListener('click', function () {
                    const type = inputField.type === 'password' ? 'text' : 'password';
                    inputField.type = type;
                    icon.classList.toggle('mdi-eye-outline');
                    icon.classList.toggle('mdi-eye-off-outline');
                });
            });
        });
    </script>
    <script>
        @if (session('success'))
        toastr.success(@json(session('success')));
        @endif
        @if (session('error'))
        toastr.error(@json(session('error')));
        @endif
        @if ($errors->any())
        @foreach ($errors->all() as $error)
        toastr.error(@json($error));
        @endforeach
        @endif
    </script>
@endsection
