@extends('site.layouts.base')

@section('title', 'حریم خصوصی')

@section('content')

    <section class="breadcrumb blog-details-breadcrumb">
        <div class="container">
            <div class="row justify-content-center">
                <div class="col-lg-8">
                    <div class="breadcrumb__wrapper">
                        <h2 class="breadcrumb__title mt-2">
                            {{$thispage->title}}
                        </h2>
                    </div>
                </div>
            </div>
        </div>
    </section>

    <section class="blog-section section-one-bg py-120">
        <div class="container">
            <div class="row row-gap-5 justify-content-center">
                <div class="col-lg-8">
                    <div class="d-grid row-gap-5">
                        <div class="blog-details-content">

                            <h2>مقررات حریم خصوصی موسسه حقوقی دادورزان امین</h2>

                            <p>1) مقدمه</p>

                            <ol>
                                <li>موسسه حقوقی دادورزان امین (سهامی خاص) به شماره ثبت 41727 (ما) در این سند به بیان مقررات حریم خصوصی می&zwnj;پردازد. این سند با هدف بیان نحوه جمع&zwnj;آوری اطلاعات از کاربران (شما)، ذخیره سازی و محافظت این داده&zwnj;ها تنظیم شده است. ما همواره متعهدیم ضمن ارائه بالاترین کیفیت خدمات، امنیت اطلاعات کاربران را در بالاترین سطح ممکن حفظ نموده و برای حفظ اعتماد شما بهترین تلاش ممکن خود را بنماییم.</li>
                                <li>حفظ حریم خصوصی کلیه کاربران بخش جدایی&zwnj;ناپذیر سیاست&zwnj;های ماست. کلیه اطلاعاتی که ما از شما جمع&zwnj;آوری می&zwnj;کنیم حسب الزامات قانونی، مفاد این سند و اصول فنی و در راستای ارائه بهتر خدمات است.</li>
                                <li>ما مجاز و محق هستیم که در مفاد این سند در هر زمان تغییراتی را به صورت کلی و یا جزئی اعمال نماییم. بدیهی&zwnj;ست این تغییرات به اطلاع شما از طریق مقتضی خواهد رسید. در صورتی که پس از اطلاع رسانی، به استفاده خود از خدمات دادورزان امین ادامه دهید، این امر به منزله پذیرش کلیه تغییرات از سوی شما است.</li>
                                <li>شما باید در راستای محافظت از داده&zwnj;ها و اطلاعات خود، نکات ایمنی را رعایت نمایید. اگر رمز ورودتان به حساب کاربری در دادورزان امین افشا شده است، لطفاً فوراً نسبت به تغییر آن اقدام نمایید.</li>
                            </ol>

                            <p>2) ما چه اطلاعاتی را جمع آوری می&zwnj;کنیم؟</p>

                            <ul>
                                <li><strong>الف)</strong><strong>&nbsp;</strong>اطلاعات شخصی کاربران: شما برای ایجاد حساب کاربری دادورزان امین باید شماره همراه خود را در وبسایت دادورزان امین وارد نمایید. سپس ممکن است اطلاعاتی از قبیل نام و نام خانوادگی، نام کسب و کار، اندازه کسب و کار، موقعیت شغلی شما، آدرس ایمیل از شما جمع&zwnj;آوری شود.</li>
                                <li><strong>ب)</strong><strong>&nbsp;</strong>اطلاعات فنی شامل نوع دستگاه، زبان و نوع سیستم عامل، فایل&zwnj;های دانلودشده و صفحات مشاهده&zwnj;شده،IP، اطلاعات فنی و گزارش&zwnj;های سرور شامل نوع شبکه، نوع و نسخه مرورگر، سوابق کلیه خریدها و مکاتبات در تماس با تیم پشتیبانی.
                                    <ul>
                                        <li><strong>تبصره1:</strong><strong>&nbsp;</strong>جمع&zwnj;آوری این اطلاعات این امکان را برای ما فراهم می&zwnj;آورد که تجربه کاربری را برای کاربران بهبود و ارتقا دهیم.</li>
                                        <li><strong>تبصره2:</strong><strong>&nbsp;</strong>مرورگر اینترنت، کوکی&zwnj;ها را برای پیگیری و گاهی ردگیری اطلاعات خاصی بر روی کامپیوتر کاربر ذخیره می&zwnj;کند. شما می&zwnj;توانید مرورگر خود را تنظیم کنید تا کوکی&zwnj;ها را ذخیره نکند و یا در هنگام ذخیره هشدار دهد. اگر از این امکان استفاده کنید ممکن است بخش&zwnj;هایی از سایت به درستی عمل نکنند.</li>
                                    </ul>
                                </li>
                                <li><strong>ج)</strong><strong>&nbsp;</strong>اکثر اطلاعاتی که از شما جمع آوری می&zwnj;شود توسط خودتان در اختیار ما قرار داده می&zwnj;شود. بخشی از اطلاعات شما نیز از طرف ما به صورت خودکار جمع&zwnj;آوری می&zwnj;شود مانند وقتی که با استفاده از کوکی&zwnj;های مرورگر برای بازدید یا استفاده از دادورزان امین اقدام می&zwnj;نمایید.</li>
                            </ul>

                            <p>3) ذخیره سازی اطلاعات در دادورزان امین به چه شکلی است؟</p>

                            <ol>
                                <li>برای ذخیره&zwnj;سازی اطلاعات کاربران دادورزان امین از فناوری&zwnj;های پیچیده و به روز استفاده می&zwnj;شود و تیم فنی دادورزان امین تمامی تلاش خود را به کار می&zwnj;گیرد تا حتی الامکان از خطرات مربوط به افشای اطلاعات کاربران، آسیب دیدن یا سوء استفاده از آن&zwnj;ها جلوگیری به عمل آورد.</li>
                                <li>کلیه اطلاعات کاربران در مکان و سرور امن نگه داری می&zwnj;شوند و فقط تعدادی از کارمندان دادورزان امین در چارچوب قوانین و آیین&zwnj;نامه&zwnj;های شرکت، مجاز به دسترسی به اطلاعات در راستای ایفای تعهدات خود هستند.</li>
                                <li>با وجود تمام تلاش&zwnj;های ما برای حفظ اطلاعات و عدم دسترسی اشخاص ثالث به اطلاعات شما، ممکن است در نتیجه اقدامات خرابکارانه و حملات سایبری، اشخاص ثالث به بخش یا تمامی اطلاعات به صورت غیر مجاز دسترسی پیدا کنند. در این صورت ما مسئولیتی بر عهده نداشته و در چارچوب قوانین موجود حق طرح دعوا علیه اشخاص ثالث به منظور حفظ حقوق خودمان و شما را خواهیم داشت.</li>
                                <li>وکلا و کارشناسان حقوقی دادورزان امین واجد قدرت و اختیارات فرا قانونی نمی&zwnj;باشند و در حدود تجربه و تخصص خویش و طرق قانونی اقدام می&zwnj;نمایند و هیچ وکیل اختیار تعهد و تضمین نتیجه را ندارد و اقدام وکیل در راستای تعهد به عمل می&zwnj;باشد، چرا که تصمیم نهایی توسط قضات، محاکم و دستگاه قضا صادر می&zwnj;گردد و وکلا فقط در راستای احقاق حقوق کاربران در حد توان علمی و تجربه و تخصص خود عمل می&zwnj;نمایند.</li>
                            </ol>

                            <p>4) ما به چه منظور از اطلاعات جمع&zwnj;آوری&zwnj;شده استفاده می&zwnj;کنیم؟</p>

                            <ol>
                                <li>ارائه خدمات و افزایش سطح خدمات به نحوی که کاربر بتواند به نحوی کارآمد و منحصر به فرد، از کلیه امکانات دادورزان امین استفاده کند</li>
                                <li>بهبود تجربه کاربری از طریق انطباق با نیازها و شرایط کاربر و سیستم&zwnj;عامل&zwnj;های مورد استفاده در دستگاه&zwnj;های متنوع کاربران</li>
                                <li>با هدف اندازه گیری، تحقیق و توسعه بازار</li>
                                <li>ارتباط با کاربران و انجام مکاتبات</li>
                                <li>حسب مورد استفاده از اطلاعات برای پیش&zwnj;برد بهتر خدمات حقوقی</li>
                                <li>پیشنهاد خدمات و سرویس&zwnj;ها بر اساس نیاز و موقعیت شغلی کاربر</li>
                                <li>ارزیابی عملکرد دادورزان امین و رفع اشکالات در نسخه&zwnj;های آتی</li>
                                <li>اطلاع&zwnj;رسانی رخدادهای مهم، ارسال مطالب آموزشی، خبری و تبلیغاتی. اگر تمایلی به دریافت چنین محتوایی را ندارید، می&zwnj;توانید نسبت به لغو اشتراک آن اقدام نمایید. لازم به ذکر است انصراف از این موارد ممکن است دسترسی به برخی خدمات دادورزان امین را برای کاربران با مشکل مواجه کند.</li>
                            </ol>

                            <p>5) ارتباط با ما</p>

                            <p>ما تمام تلاش خود را در رابطه با حفظ حریم خصوصی و اطلاعات شخصی شما به کار می&zwnj;گیریم. اگر در رابطه با مفاد این سند سوالی دارید، لطفاً از طریق بخش ارتباط با ما، سوالات خود را با ما در میان بگذارید.</p>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </section>
@endsection
